#for preprocessing files

import pandas as pd

# files = [
#     "атырау атырау 2021.xlsx",
#     "атырау ганюшкино 2021.xlsx",
#     "атырау индерборский 2021.xlsx",
#     "атырау карабау 2021.xlsx",
#     "атырау кульсары 2021.xlsx",
#     "атырау махамбет 2021.xlsx",
#     "атырау новый уштоган 2021.xlsx",
#     "атырау пешной 2021.xlsx",
#     "атырау сагиз 2021.xlsx",

#     "атырау атырау 2024.xlsx",
#     "атырау ганюшкино 2024.xlsx",
#     "атырау индерборский 2024.xlsx",
#     "атырау карабау 2024.xlsx",
#     "атырау кульсары 2024.xlsx",
#     "атырау махамбет 2024.xlsx",
#     "атырау новый уштоган 2024.xlsx",
#     "атырау пешной 2024.xlsx",
#     "атырау сагиз 2024.xlsx"
# ]


# files = [
#     "акт актобе 2024.xlsx",
#     "акт аяккум 2024.xlsx",
#     "акт ильинский 2024.xlsx",
#     "акт иргиз 2024.xlsx",
#     "акт карабутак 2024.xlsx",
#     "акт караулкельды 2024.xlsx",
#     "акт комсомольское 2024.xlsx",
#     "акт косистек 2024.xlsx",
#     # "акт мартук 2024.xlsx",
#     "акт муголджарская 2024.xlsx",
#     "акт новоалексеевка 2024.xlsx",
#     "акт нура 2024.xlsx",
#     "акт родниковка 2024.xlsx",
#     "акт темир 2024.xlsx",
#     "акт уил 2024.xlsx",
#     "акт шалкар 2024.xlsx",
#     "акт эмба 2024.xlsx",

#     "акт актобе 2021.xlsx",
#     "акт аяккум 2021.xlsx",
#     "акт ильинский 2021.xlsx",
#     "акт иргиз 2021.xlsx",
#     "акт карабутак 2021.xlsx",
#     "акт караулкельды 2021.xlsx",
#     "акт комсомольское 2021.xlsx",
#     "акт косистек 2021.xlsx",
#     # "акт мартук 2021.xlsx",
#     "акт муголджарская 2021.xlsx",
#     "акт новоалексеевка 2021.xlsx",
#     "акт нура 2021.xlsx",
#     "акт родниковка 2021.xlsx",
#     "акт темир 2021.xlsx",
#     "акт уил 2021.xlsx",
#     "акт шалкар 2021.xlsx",
#     "акт эмба 2021.xlsx"
# ]


# files = [
#     "кос амангельды 2021.xlsx",
#     "кос аркалык 2021.xlsx",
#     "кос аршалинский 2021.xlsx",
#     "кос диевская 2021.xlsx",
#     "кос екидин 2021.xlsx",
#     "кос железнодорожный 2021.xlsx",
#     "кос житикара 2021.xlsx",
#     "кос карабалык 2021.xlsx",
#     "кос караменды 2021.xlsx",
#     "кос карасу 2021.xlsx",
#     "кос костанай 2021.xlsx",
#     "кос кушмурун 2021.xlsx",
#     "кос михайловка 2021.xlsx",
#     "кос пресногорьковка 2021.xlsx",
#     "кос рудный 2021.xlsx",
#     "кос сарыколь 2021.xlsx",
#     "кос тобол 2021.xlsx",
#     "кос торгай 2021.xlsx",

#     "кос амангельды 2024.xlsx",
#     "кос аркалык 2024.xlsx",
#     "кос аршалинский 2024.xlsx",
#     "кос диевская 2024.xlsx",
#     "кос екидин 2024.xlsx",
#     "кос железнодорожный 2024.xlsx",
#     "кос житикара 2024.xlsx",
#     "кос карабалык 2024.xlsx",
#     "кос караменды 2024.xlsx",
#     "кос карасу 2024.xlsx",
#     "кос костанай 2024.xlsx",
#     "кос кушмурун 2024.xlsx",
#     "кос михайловка 2024.xlsx",
#     "кос пресногорьковка 2024.xlsx",
#     "кос рудный 2024.xlsx",
#     "кос сарыколь 2024.xlsx",
#     "кос тобол 2024.xlsx",
#     "кос торгай 2024.xlsx"
# ]

# files = [
#     "сев благовещенка 2021.xlsx",
#     "сев возвышенко 2021.xlsx",
#     "сев кишкенеколь 2021.xlsx",
#     "сев петропавловск 2021.xlsx",
#     "сев рузаевка 2021.xlsx",
#     "сев саумалколь 2021.xlsx",
#     "сев сергеевка 2021.xlsx",
#     "сев тайынша 2021.xlsx",
#     "сев тимирязево 2021.xlsx",
#     "сев чкалово 2021.xlsx",

#     "сев благовещенка 2024.xlsx",
#     "сев возвышенко 2024.xlsx",
#     "сев кишкенеколь 2024.xlsx",
#     "сев петропавловск 2024.xlsx",
#     "сев рузаевка 2024.xlsx",
#     "сев саумалколь 2024.xlsx",
#     "сев сергеевка 2024.xlsx",
#     "сев тайынша 2024.xlsx",
#     "сев тимирязево 2024.xlsx",
#     "сев чкалово 2024.xlsx"
# ]

files = [
    "зап аксай 2021.xlsx",
    "зап джамбейты 2021.xlsx",
    "зап джангала 2021.xlsx",
    "зап джаныбек 2021.xlsx",
    "зап жалпактал 2021.xlsx",
    "зап каменка 2021.xlsx",
    "зап каратюба 2021.xlsx",
    "зап тайпак 2021.xlsx",
    "зап уральск 2021.xlsx",
    "зап урда 2021.xlsx",
    "зап чапаево 2021.xlsx",
    "зап чингирлау 2021.xlsx",
    "зап январцево 2021.xlsx",

    "зап аксай 2024.xlsx",
    "зап джамбейты 2024.xlsx",
    "зап джангала 2024.xlsx",
    "зап джаныбек 2024.xlsx",
    "зап жалпактал 2024.xlsx",
    "зап каменка 2024.xlsx",
    "зап каратюба 2024.xlsx",
    "зап тайпак 2024.xlsx",
    "зап уральск 2024.xlsx",
    "зап урда 2024.xlsx",
    "зап чапаево 2024.xlsx",
    "зап чингирлау 2024.xlsx",
    "зап январцево 2024.xlsx"
]


merged = []

for f in files:
    df = pd.read_excel(f, header=None)

    df = df.iloc[3:].reset_index(drop=True)

    try:
        df[1] = pd.to_datetime(df[1], errors="coerce").dt.strftime("%d.%m.%Y")
    except:
        pass

    merged.append(df)

final_df = pd.concat(merged, ignore_index=True)

final_df.to_excel("preprocess.xlsx", header=False, index=False)

print("ГОТОВО! Файл сохранён как preprocess.xlsx")
